---
kind: type
id: T:Autodesk.Revit.DB.Visual.AssetPropertyInt64
source: html/65ae8ae5-6310-a937-913e-de7ff539aaed.htm
---
# Autodesk.Revit.DB.Visual.AssetPropertyInt64

Represents a property of Int64 value.

## Syntax (C#)
```csharp
public class AssetPropertyInt64 : AssetProperty
```